#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.nat.data.aws_ec2_instance_type.selected: Reading...
data.aws_ssm_parameter.wireguard_interface_peers: Reading...
data.aws_ssm_parameter.wireguard_interface_private_key: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02f71590ffce04a6d]
module.nat.aws_iam_role.this: Refreshing state... [id=vpc-us-east-1-prd-nat-role]
data.aws_availability_zones.available: Reading...
module.wireguard.data.aws_ec2_instance_type.this: Reading...
data.aws_ssm_parameter.wireguard_interface_peers: Read complete after 0s [id=/prd/aws-networking/wireguard-interface-peers]
data.aws_ssm_parameter.wireguard_interface_private_key: Read complete after 0s [id=/prd/aws-networking/wireguard-interface-private-key]
module.wireguard.data.aws_ec2_instance_type.this: Read complete after 0s [id=t4g.nano]
module.wireguard.data.aws_ami.this: Reading...
module.nat.data.aws_ec2_instance_type.selected: Read complete after 0s [id=t4g.nano]
module.nat.data.aws_ami.fck_nat: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.nat.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonSSMManagedEC2InstanceDefaultPolicy"]: Refreshing state... [id=vpc-us-east-1-prd-nat-role-20241231192803224900000001]
module.nat.aws_iam_instance_profile.this: Refreshing state... [id=vpc-us-east-1-prd-nat-instance-profile]
module.nat.data.aws_ami.fck_nat: Read complete after 0s [id=ami-075a0093cd9926d44]
module.wireguard.data.aws_ami.this: Read complete after 0s [id=ami-02dcfe5d1d39baa4e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d0823136d4d8684e]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c7d69b1ce54dc090]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08368933c60282243]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0c9c6a3cb3c951e27]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05b1659ce2fe16e2c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06c4b56d1b75b8310]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cf27de01155493d6]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04da9a7dd058adaee]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac57b68b9ecc3021]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d938e60a6926f078]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08ff933fc0cd1a8ed]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-06708985e3206850f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09570b4468b3fc794]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04c387144d0f7b1c3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-001198b7fde46da8f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-022d83949d5645880]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b1443d53ffdace20]
module.nat.data.aws_subnet.selected: Reading...
module.wireguard.data.aws_subnet.this: Reading...
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d938e60a6926f0781080289494]
module.nat.data.aws_subnet.selected: Read complete after 0s [id=subnet-09570b4468b3fc794]
module.nat.data.aws_vpc.selected: Reading...
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0762fa9cc0db44716]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07756c215d0f1ed17]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0350dc3c543036138]
module.wireguard.data.aws_subnet.this: Read complete after 0s [id=subnet-09570b4468b3fc794]
module.wireguard.data.aws_vpc.this: Reading...
module.nat.data.aws_vpc.selected: Read complete after 0s [id=vpc-02f71590ffce04a6d]
module.nat.aws_security_group.this: Refreshing state... [id=sg-07c4d256cab7a8737]
module.wireguard.data.aws_vpc.this: Read complete after 0s [id=vpc-02f71590ffce04a6d]
module.nat.aws_network_interface.this: Refreshing state... [id=eni-07da500abdb01794c]
module.nat.aws_vpc_security_group_ingress_rule.cidr_block: Refreshing state... [id=sgr-014518305cd70639a]
module.nat.aws_vpc_security_group_egress_rule.all: Refreshing state... [id=sgr-050f1602f0e9d3559]
aws_route.nat["rtb-06c4b56d1b75b8310"]: Refreshing state... [id=r-rtb-06c4b56d1b75b83101080289494]
aws_route.nat["rtb-04da9a7dd058adaee"]: Refreshing state... [id=r-rtb-04da9a7dd058adaee1080289494]
aws_route.nat["rtb-0c9c6a3cb3c951e27"]: Refreshing state... [id=r-rtb-0c9c6a3cb3c951e271080289494]
module.nat.aws_launch_template.this: Refreshing state... [id=lt-0aaf44fb5be81d220]
module.nat.aws_autoscaling_group.this: Refreshing state... [id=vpc-us-east-1-prd-nat-asg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_eip.wireguard will be created
  + resource "aws_eip" "wireguard" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + tags_all             = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + vpc                  = (known after apply)
    }

  # aws_route.nat["rtb-0c9c6a3cb3c951e27"] will be updated in-place
  ~ resource "aws_route" "nat" {
        id                     = "r-rtb-0c9c6a3cb3c951e271080289494"
      ~ network_interface_id   = "eni-0cd372c32650704b0" -> "eni-07da500abdb01794c"
        # (6 unchanged attributes hidden)
    }

  # module.wireguard.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = [
          + "us-east-1a",
        ]
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "vpc-us-east-1-prd-wireguard-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "vpc-us-east-1-prd-wireguard"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "prd"
        }
      + tag {
          + key                 = "project"
          + propagate_at_launch = true
          + value               = "aws-networking"
        }
      + tag {
          + key                 = "terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.wireguard.aws_eip_association.this will be created
  + resource "aws_eip_association" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.wireguard.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "vpc-us-east-1-prd-wireguard-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "vpc-us-east-1-prd-wireguard-role"
      + tags        = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + tags_all    = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.wireguard.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc-us-east-1-prd-wireguard-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + tags_all              = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.wireguard.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonSSMManagedEC2InstanceDefaultPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedEC2InstanceDefaultPolicy"
      + role       = "vpc-us-east-1-prd-wireguard-role"
    }

  # module.wireguard.aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-02dcfe5d1d39baa4e"
      + instance_type   = "t4g.nano"
      + latest_version  = (known after apply)
      + name            = "vpc-us-east-1-prd-wireguard-lt"
      + name_prefix     = (known after apply)
      + tags            = {
          + "Name"        = "vpc-us-east-1-prd-wireguard"
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + tags_all        = {
          + "Name"        = "vpc-us-east-1-prd-wireguard"
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + user_data       = (sensitive value)

      + iam_instance_profile {
          + name = "vpc-us-east-1-prd-wireguard-instance-profile"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + network_interface_id = (known after apply)
        }
    }

  # module.wireguard.aws_network_interface.this will be created
  + resource "aws_network_interface" "this" {
      + arn                       = (known after apply)
      + description               = "vpc-us-east-1-prd-wireguard-eni"
      + enable_primary_ipv6       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = false
      + subnet_id                 = "subnet-09570b4468b3fc794"
      + tags                      = {
          + "Name"        = "vpc-us-east-1-prd-wireguard"
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + tags_all                  = {
          + "Name"        = "vpc-us-east-1-prd-wireguard"
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
    }

  # module.wireguard.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "vpc-us-east-1-prd-wireguard"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpc-us-east-1-prd-wireguard-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "vpc-us-east-1-prd-wireguard"
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "vpc-us-east-1-prd-wireguard"
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-02f71590ffce04a6d"
    }

  # module.wireguard.aws_vpc_security_group_egress_rule.this will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic out of vpc-us-east-1-prd-wireguard-sg"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "environment" = "prd"
          + "project"     = "aws-networking"
          + "terraform"   = "true"
        }
    }

Plan: 10 to add, 1 to change, 0 to destroy.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*